import pandas as pd
import numpy as np

data = {
    'Ученик': ['Анна', 'Борис', 'Виктор', 'Галина', 'Дмитрий',
               'Елена', 'Жанна', 'Захар', 'Ирина', 'Кирилл'],
    'Математика': [5, 4, 3, 5, 4, 5, 4, 3, 5, 4],
    'Физика': [4, 3, 4, 5, 4, 3, 5, 4, 4, 3],
    'Химия': [5, 4, 3, 4, 5, 4, 3, 4, 5, 4],
    'Литература': [4, 5, 4, 3, 4, 5, 4, 5, 4, 5],
    'История': [3, 4, 5, 4, 3, 4, 5, 4, 3, 4]
}

df = pd.DataFrame(data)

print(df)
print('-'*60)
print(f'Средняя оценка по математике - {df["Математика"].mean()}')
print(f'Средняя оценка по физике - {df["Физика"].mean()}')
print(f'Средняя оценка по химии - {df["Химия"].mean()}')
print(f'Средняя оценка по литературе - {df["Литература"].mean()}')
print(f'Средняя оценка по истории - {df["История"].mean()}')
print('-'*60)
print(f'Мидианная оценка по математике - {df["Математика"].median()}')
print(f'Мидианная оценка по физике - {df["Физика"].median()}')
print(f'Мидианнаяя оценка по химии - {df["Химия"].median()}')
print(f'Мидианная оценка по литературе - {df["Литература"].median()}')
print(f'Мидианная оценка по истории - {df["История"].median()}')
print('-'*60)
Q1_math = df['Математика'].quantile(0.25)
Q3_math = df['Математика'].quantile(0.75)
IQR = Q3_math - Q1_math
print(f'Q1_math = {Q1_math}, Q3_math = {Q3_math}, IQR = {IQR},')
print('-'*60)
print(f'Стандартное отклонение оценок по математике - {df["Математика"].std()}')
print(f'Стандартное отклонение оценок по физике - {df["Физика"].std()}')
print(f'Стандартное отклонение оценок по химии - {df["Химия"].std()}')
print(f'Стандартное отклонение оценок по литературе - {df["Литература"].std()}')
print(f'Стандартное отклонение оценок по истории - {df["История"].std()}')




